In [2]:
#Pandas Basic Assignment
import pandas as pd

In [4]:
#Q.1 Ans:-
seriesA = pd.Series([4, 8, 15, 16, 23,42])
seriesA

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#Q.2 Ans:-
testlist = ['a','m','r','i','t', 1,2,3,4,5]
seriesB = pd.Series(testlist)
seriesB

0    a
1    m
2    r
3    i
4    t
5    1
6    2
7    3
8    4
9    5
dtype: object

In [8]:
#Q.3 Ans:-

dataframe1 = pd.DataFrame([['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']],columns=['Name', 'Age', 'Gender'])
dataframe1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
#Q.4 Ans:-
'''
Dataframe:-

In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is similar 
to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column can be considered as a pandas series,
but a DataFrame allows for multiple columns to be combined together in a single object.

Series:-

A pandas Series, on the other hand, is a one-dimensional labeled array that can contain data of any type (numeric, string, 
boolean, etc.) and can be indexed with labels or integers. A Series is essentially a single column of data, but it can also 
have a name attribute that provides a label for the data.

'''
# Series
pd.Series([1, 2, 3, 4, 5])

# Dataframe
pd.DataFrame([[2,4,6],[10,20,30],['A','B','C']])

    0   1   2
0   2   4   6
1  10  20  30
2   A   B   C

In [11]:
#Q.5 Ans:-

dataframe2 = pd.DataFrame([[2,4,6],[10,20,30],['A','B','C']])
dataframe2

    0   1   2
0   2   4   6
1  10  20  30
2   A   B   C

In [12]:
## Rename - column and index
dataframe2.index=['one','two', 'three']
dataframe2.columns=['price','age','value']
dataframe2

      price age value
one       2   4     6
two      10  20    30
three     A   B     C

In [14]:
# Print first 2 dataset
dataframe2.head(2)

    price age value
one     2   4     6
two    10  20    30

In [15]:
# Print last 2 dataset
dataframe2.tail(2)

      price age value
two      10  20    30
three     A   B     C

In [ ]:
#Q.6 Ans:-
'''
All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.

Series - Size Immutable, Values Mutable
DataFrame - Size Mutable, Values Mutable
Panel - Size Mutable, Values Mutable

In [16]:
#Q.7 Ans:-

seriesC  = pd.Series(['4 cups', '1 cup', '2 large', '1 can'])
seriesD  = pd.Series(['Flour', 'Milk', 'Eggs', 'Spam'])
print(type(seriesC), type(seriesD))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [17]:
pd.DataFrame([seriesD,seriesC])

        0      1        2      3
0   Flour   Milk     Eggs   Spam
1  4 cups  1 cup  2 large  1 can